[
    {
      "id": 1,
      "name": "Learn VueJS",
      "createdAt": "2023-03-21T15:15:30Z",
      "isDone": false,
      "description": "Vue is a JavaScript framework for building user interfaces. It builds on top of standard HTML, CSS, and JavaScript and provides a declarative and component-based programming model that helps you efficiently develop user interfaces, be they simple or complex."
    },
    {
      "id": 2,
      "name": "Learn NuxtJS",
      "createdAt": "2023-03-22T15:15:30Z",
      "isDone": false,
      "description": "NuxtJS is a JavaScript framework for building user interfaces. It builds on top of standard HTML, CSS, and JavaScript and provides a declarative and component-based programming model that helps you efficiently develop user interfaces, be they simple or complex."
    },
    {
      "id": 3,
      "name": "Learn ReactJS",
      "createdAt": "2023-03-23T15:15:30Z",
      "isDone": true,
      "description": "ReactJS is a JavaScript framework for building user interfaces. It builds on top of standard HTML, CSS, and JavaScript and provides a declarative and component-based programming model that helps you efficiently develop user interfaces, be they simple or complex."
    },
    {
      "id": 4,
      "name": "Learn NextJS",
      "createdAt": "2023-03-24T15:15:30Z",
      "isDone": false,
      "description": "NextJS is a JavaScript framework for building user interfaces. It builds on top of standard HTML, CSS, and JavaScript and provides a declarative and component-based programming model that helps you efficiently develop user interfaces, be they simple or complex."
    },
    {
      "id": 5,
      "name": "Learn NodeJS",
      "createdAt": "2023-03-25T15:15:30Z",
      "isDone": true,
      "description": "NodeJS is a JavaScript framework for building user interfaces. It builds on top of standard HTML, CSS, and JavaScript and provides a declarative and component-based programming model that helps you efficiently develop user interfaces, be they simple or complex."
    }
  ]